system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  9
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

// Zelleneinstellungen
xcells 20;
ycells 400;
zcells 1;

//---------------------------------------------------------------------------//
// Koordinaten
xPos 1;
xPosNeg 0;

yPos 20;
yPosNeg 0;

zPos 1;
zPosNeg 0;

convertToMeters 1e-3;

//---------------------------------------------------------------------------//
vertices
(
    ($xPosNeg 		$yPosNeg	    $zPosNeg) 	//1
    ($xPos			$yPosNeg		$zPosNeg) 	//2
    ($xPos 			$yPos 	        $zPosNeg) 	//3
    ($xPosNeg		$yPos   		$zPosNeg) 	//4
	
    ($xPosNeg		$yPosNeg		$zPos)   	//5
    ($xPos 			$yPosNeg		$zPos) 	    //6
    ($xPos 			$yPos  		    $zPos) 	    //7
    ($xPosNeg		$yPos    		$zPos) 	    //8
);


//---------------------------------------------------------------------------//
blocks
(
    hex (0 1 2 3 4 5 6 7) ($xcells $ycells $zcells) simpleGrading (1 1 1)
);


//---------------------------------------------------------------------------//
edges
(
);


//---------------------------------------------------------------------------//
boundary
(
    inlet
    {
        type patch;
        faces
        (
            (1 5 4 0)
        );
    }
    atmosphere
    {
        type patch;
        faces
        (
            (3 7 6 2)
        );
    }
    walls
    {
        type wall;
        faces
        (
            (0 4 7 3)
            (2 6 5 1)
        );
    }
    frontAndBack
    {
        type empty;
        faces
        (
            (0 3 2 1)
            (4 5 6 7)
        );
    }
);


//---------------------------------------------------------------------------//
mergePatchPairs
(
);


// ************************************************************************* //
